Repository: Pinakastra-Computing/boss
Catalog: backend/locale/*/LC_MESSAGES/boss.po
Languages: ru

source: Not Found
ru: Не найден

source: Method is not implemented
ru: Метод еще не реализован

source: Database is down. Please try again a bit later
ru: Отказ базы данных. Пожалуйста, попробуйте позднее

source: Cache database is down. Please try again a bit later
ru: Отказ кэширующей базы. Пожалуйста, попробуйте позднее

source: Has to have translation for default language: '{}'
ru: Должен иметь перевод для языка по умолчанию: '{}'

source: User account already exists
ru: Пользователь уже существует

source: User account is removed
ru: Пользователь удален

source: Customer account already exists
ru: Заказчик уже существует

source: Incorrect email/password
ru: Некорректные почта или пароль

source: Invalid token
ru: Некорректный токен

source: Not enough rights to perform this action
ru: Недостаточно прав для выполнения этого действия

source: Email sending is impossible
ru: Отправка письма невозможна

source: User account not found
ru: Пользователь не найден

source: Customer account not found
ru: Заказчик не найден

source: Service not found
ru: Услуга не найдена

source: Service already exists
ru: Сервис уже существует

source: Used service cannot be removed
ru: Услуга используется и не может быть удалена

source: Immutable service cannot be changed
ru: Неизменяемая услуга не может быть изменена

source: Removed service cannot be changed
ru: Удаленная услуга не может быть изменена

source: Removed service cannot be included in plan
ru: Удаленная услуга не может быть добавлена в тариф

source: Only immutable service can be included in plan
ru: Только неизменяемая услуга может быть вклюена в тариф

source: Plan not found
ru: Тариф не найден

source: Role not found
ru: Роль не найдена

source: News not found
ru: Новость не найдена

source: Can not delete self
ru: Не возможно удалить самого себя

source: Immutable plan cannot be changed
ru: Неизменяемый тариф не может быть изменен

source: Removed plan cannot be changed
ru: Удаленный тариф не может быть изменён

source: Password reset link is invalid, expired or was already used. Please try to request password reset again
ru: Ссылка для восстановления пароля неверена, просрочена или уже использована. Попробуйте восстановить пароль еще раз

source: Email confirmation link is invalid, expired or was already used. Please try to resend a confirmation email
ru: Ссылка для подтверждения почтового адреса неверена, просрочена или уже использована. Попробуйте запросить подтверждающее письмо еще раз

source: Plan already exists
ru: Тариф уже существует

source: Report aggregation is not ready
ru: Отчет еще не готов

source: Plan history entry not found
ru: Запись истории тарифа не найдена

source: Nothing to update
ru: Не заданы параметры для обновления

source: Error while rendering a template
ru: Ошибка генерации шаблона

source: Invalid number format
ru: Неверный формат значения

source: Parent plan should have the same currency
ru: Родительский тариф должен быть с той же валютой

source: Subscription already exists
ru: Подписка уже существует

source: Invalid subscription data
ru: Неправильный формат подписной информации

source: Used plan cannot be removed
ru: Тариф используется и не может быть удален

source: Mutable plan cannot be assigned to a customer
ru: Изменяемый тариф не может быть назначен заказчику

source: Mutable plan cannot be default
ru: Неизменяемый тариф не может быть тарифом по умолчанию

source: Quota for this customer already exists
ru: Квота для этого заказчика уже существует

source: The news already exists
ru: Новость уже существует

source: Removed news cannot be changed
ru: Удаленная новость не может быть изменена

source: Customer has no OpenStack login. Please contact the administrator.
ru: У пользователя нет учетной записи для доступа к облаку OpenStack. Пожалуйста, обратитесь к администратору.

source: Unsuccessful request to Horizon. Please contact the administrator.
ru: Подключение к облаку OpenStack закончилось неудачей. Пожалуйста, обратитесь к администратору.

source: Unable to login into Horizon the current OpenStack login/password. Please contact the administrator.
ru: Невозможно авторизоваться в облаке OpenStack с текущей парой логин/пароль. Пожалуйста, обратитесь к администратору.

source: Need to fill in all mandatory fields to switch to production mode.
ru: Для перехода в продуктовый режим необходимо заполнить все обязательные поля

source: start parameter should be earlier than finish
ru: Параметр start должен быть меньше чем finish

source: Tenant is not created yet. Try again latter
ru: Tenant не создан еще. Пожалуйста, попробуйте позднее

source: Customer email is not confirmed
ru: Email заказчика не подтвержден

source: Customer is blocked
ru: Заказчик заблокирован

source: Customer is removed
ru: Заказчик удален

source: Payment card already removed.
ru: Платежная карта уже удалена

source: Payment card not found.
ru: Платежная карта не найдена

source: Option already exists
ru: Опция уже существует

source: Payment card already exists
ru: Платежная карта уже существует

source: Customer is not entity
ru: Заказчик не юридическое лицо

source: Invalid promo code.
ru: Некорректный промо-код.

source: Registration with promo code only.
ru: Регистрация только по промо-кодам.

source: Promo code already removed
ru: Промокод уже удален

source: Report format is not supported
ru: Запрашиваемый формат отчета не поддерживается

source: Flavor already exists
ru: Флавор уже существует

source: Flavor not found
ru: Флавор не найден

source: Flavor already exists in OS with different parameters
ru: Флавор уже существует в OS с другими параметрами

source: Invalid parameter {}. It should have type {}
ru: Некорректно передан параметр {}, он должен быть {}

source: {} is required
ru: Требуется {}

source: Invalid encoding: %s
ru: Неправильная кодировка: %s

source: Field {} is required
ru: Требуется {}

source: Unexpected element {}
ru: Неожиданный элемент {}

source: Cannot decode JSON {}
ru: Невозможно декодировать JSON {}

source: list is expected
ru: ожидается список

source: should be a dict
ru: должен быть словарем

source: {} should be integer
ru: {} должно быть целым

source: Value should be greater than {}
ru: Значение должно превышать {}

source: Value should be less than {}
ru: Значение не должно быть менее, чем {}

source: Invalid format. Expected '[-]field_name', where field_name one of: {}
ru: Неверный формат. Ожидается '[-]field_name', где параметр 'field_name' - один из {}

source: Incorrect day format
ru: Неверный формат дня

source: Incorrect date format
ru: Неверный формат даты

source: Date expired
ru: Дата просрочена

source: Incorrect time format
ru: Неверный формат времени

source: value should one from list: {}
ru: Значение должно быть из списка {}

source: Email must include @ symbol
ru: Почтовый адрес должен включать символ @

source: mail box in email is incorrect
ru: Почтовый ящик в адресе некорректен

source: Domain part of email is incorrect
ru: Доменная часть почтового адреса некорректна

source: Amount should be positive
ru: Значение должно быть положительным числом

source: Amount should be negative
ru: Значение должно быть отрицательным числом

source: Money format is xx.xx
ru: Деньги должны задаваться в формате xx.xx

source: Incorrect locale {}
ru: Некорректная локаль {}

source: Language {} is not active
ru: Язык {} не активирован

source: string length must be between {} and {}
ru: длина строки должна быть между {} и {}

source: Value should be int
ru: Значение должно быть целым числом

source: Value should be smaller than {}
ru: Значение не должно быть меньше, чем {}

source: {} should be positive integer
ru: {} должно быть натуральный числом

source: {} should be positive float
ru: {} должно быть положительным вещественным числом

source: should match regex: {}
ru: должен удовлетворять регулярному выражению {}

source: {} has to be a dictionary
ru: {} должен быть словарем

source: Balance recharge via CloudPayments. Transaction: {}
ru: Пополнение счета через платежную систему CloudPayments. Транзакция: {}

source: must be a dict
ru: должен быть словарем

source: subscription name must be one from list: {}
ru: Имя подписки должно быть одним из списка {}

source: Subscription can contain only 'enable' and 'email' keys
ru: Подписка может содержать только поля 'enable' и 'email'

source: quota name must be one from list: {}
ru: Имя квоты должно быть одним из списка {}

source: Incorrect date format. The expected format is %s or %s
ru: Не корректный формат даты. Ожидаемый формат %s или %s

source: Date from future
ru: Дата из будущего

source: Unexpected variables in template: {}
ru: Неизвестные переменные в шаблоне: {}

source: Error while rendering template: %s
ru: Ошибка генерации по шаблону: %s

source: Automated balance recharge via CloudPayments. Customer email: {}
ru: Автопополнение счета через платежную систему CloudPayments. E-mail клиента: {}

source: Manual balance recharge via CloudPayments. Customer email: {}
ru: Пополнение счета через платежную систему CloudPayments. E-mail клиента: {}
